status/2020/31oct20.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-28 Sat 07:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>25 October 2020 - 31 October 2020</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">25 October 2020 - 31 October 2020</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga644f13">1. Live Oak Weather Station</a>
<ul>
<li><a href="#org3ce2fdf">1.1. PM interface</a></li>
<li><a href="#org9f43d82">1.2. UV interface</a></li>
<li><a href="#orgcb0ef8b">1.3. BME680 interface</a></li>
<li><a href="#org3ddf733">1.4. Argent WS-1</a></li>
<li><a href="#orgd606739">1.5. Sensor shelter</a></li>
<li><a href="#orgbd80745">1.6. System shelter</a></li>
<li><a href="#org514ac1d">1.7. Sensor mount</a></li>
</ul>
</li>
<li><a href="#orgc9141a7">2. Three sided coin</a></li>
<li><a href="#orgadc2bb8">3. Fedora 33 update</a>
<ul>
<li><a href="#org81b0d97">3.1. SSH</a></li>
<li><a href="#orga66ff8b">3.2. x.org</a></li>
<li><a href="#org9ed2533">3.3. Firefox</a></li>
</ul>
</li>
<li><a href="#org68b9a6b">4. Alum Rock Data Center</a>
<ul>
<li><a href="#orge46c6c4">4.1. Windstorm</a></li>
<li><a href="#orgbe68737">4.2. Skylight</a></li>
</ul>
</li>
<li><a href="#orga083954">5. Trips</a></li>
<li><a href="#orgc43b2de">6. Speaking of pandemic</a></li>
</ul>
</div>
</div>
<p>
Happy Halloween!
</p>

<div id="outline-container-orga644f13" class="outline-2">
<h2 id="orga644f13"><span class="section-number-2">1.</span> Live Oak Weather Station</h2>
<div class="outline-text-2" id="text-1">
<p>
Finishing sensors, starting packaging
</p>
</div>

<div id="outline-container-org3ce2fdf" class="outline-3">
<h3 id="org3ce2fdf"><span class="section-number-3">1.1.</span> PM interface</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Ported user space driver from RIOT
</p>
</div>
</div>
<div id="outline-container-org9f43d82" class="outline-3">
<h3 id="org9f43d82"><span class="section-number-3">1.2.</span> UV interface</h3>
<div class="outline-text-3" id="text-1-2">
<p>
User space driver in progress
</p>
</div>
</div>
<div id="outline-container-orgcb0ef8b" class="outline-3">
<h3 id="orgcb0ef8b"><span class="section-number-3">1.3.</span> BME680 interface</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Using Linux I2C IIO driver
</p>
</div>
</div>
<div id="outline-container-org3ddf733" class="outline-3">
<h3 id="org3ddf733"><span class="section-number-3">1.4.</span> Argent WS-1</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Using ancient MOS7703 serial dongle and random driver on github
</p>

<p>
<a href="https://github.com/tomszilagyi/mos7703">https://github.com/tomszilagyi/mos7703</a>
</p>
</div>
</div>

<div id="outline-container-orgd606739" class="outline-3">
<h3 id="orgd606739"><span class="section-number-3">1.5.</span> Sensor shelter</h3>
<div class="outline-text-3" id="text-1-5">
<p>
One more section, plus top and bottom cover printed.
</p>

<p>
Need to build wiring harness and connectorization.
</p>
</div>
</div>

<div id="outline-container-orgbd80745" class="outline-3">
<h3 id="orgbd80745"><span class="section-number-3">1.6.</span> System shelter</h3>
<div class="outline-text-3" id="text-1-6">
<p>
3x8x8 1/2" oak veneer ply finished with 3 coats of varathane
</p>
</div>
</div>

<div id="outline-container-org514ac1d" class="outline-3">
<h3 id="org514ac1d"><span class="section-number-3">1.7.</span> Sensor mount</h3>
<div class="outline-text-3" id="text-1-7">
<p>
1/2" EMT with a 90 degree bend
</p>

<p>
Mast attached to EMT with (3) 4-40 screws
</p>

<p>
Mount will be attached to underside of corner eave.
</p>
</div>
</div>
</div>

<div id="outline-container-orgc9141a7" class="outline-2">
<h2 id="orgc9141a7"><span class="section-number-2">2.</span> Three sided coin</h2>
<div class="outline-text-2" id="text-2">
<p>
From:
</p>

<p>
<a href="https://www.quantamagazine.org/l-mahadevan-finds-math-inspiration-in-the-mundane-20201026/">https://www.quantamagazine.org/l-mahadevan-finds-math-inspiration-in-the-mundane-20201026/</a>
</p>

<p>
turned a "three sided coin" out of aluminum.
</p>

<p>
Need to work out a repeatable coin flipper for such a thick
coin. Flipping by hand (or by the small catapult my sister Maureen got
me for Christmas last year) shows a strong bias for the side, but I
need to rule out problems the flipping process first.
</p>
</div>
</div>

<div id="outline-container-orgadc2bb8" class="outline-2">
<h2 id="orgadc2bb8"><span class="section-number-2">3.</span> Fedora 33 update</h2>
<div class="outline-text-2" id="text-3">
<p>
Always an adventure to see what breaks
</p>
</div>
<div id="outline-container-org81b0d97" class="outline-3">
<h3 id="org81b0d97"><span class="section-number-3">3.1.</span> SSH</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Need additional configuration to connect to decrepit SSH servers:
</p>

<p>
KexAlgorithms=+diffie-hellman-group1-sha1
</p>

<p>
PubkeyAcceptedKeyTypes=+ssh-rsa
</p>
</div>
</div>

<div id="outline-container-orga66ff8b" class="outline-3">
<h3 id="orga66ff8b"><span class="section-number-3">3.2.</span> x.org</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Something decided to change the name of display outputs, so the 30-monitor
configuration was updated
</p>
</div>
</div>
<div id="outline-container-org9ed2533" class="outline-3">
<h3 id="org9ed2533"><span class="section-number-3">3.3.</span> Firefox</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Speaking of decrepit, I still need to connect to TLS 1.0 servers, which
new firefox refuses. I think update-crypto-policies is the trick:
</p>

<p>
update-crypto-policies &#x2013;set LEGACY
</p>

<p>
as indeed it is.
</p>

<p>
I need to address the aforementioned decrepitude, too.
</p>
</div>
</div>
</div>

<div id="outline-container-org68b9a6b" class="outline-2">
<h2 id="org68b9a6b"><span class="section-number-2">4.</span> Alum Rock Data Center</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orge46c6c4" class="outline-3">
<h3 id="orge46c6c4"><span class="section-number-3">4.1.</span> Windstorm</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Last Sunday's windstorm gifted me with a large branch on the ground from my
lovely Chinese Elm. Fortunately there was no collateral damage.
</p>
</div>
</div>
<div id="outline-container-orgbe68737" class="outline-3">
<h3 id="orgbe68737"><span class="section-number-3">4.2.</span> Skylight</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Replaced the skylight without falling off the roof.
</p>
</div>
</div>
</div>
<div id="outline-container-orga083954" class="outline-2">
<h2 id="orga083954"><span class="section-number-2">5.</span> Trips</h2>
<div class="outline-text-2" id="text-5">
<p>
Drove my sister Colleen to Kelsyville. First trip outside of Santa
Cruz and Santa Clara Counties since last year.
</p>
</div>
</div>
<div id="outline-container-orgc43b2de" class="outline-2">
<h2 id="orgc43b2de"><span class="section-number-2">6.</span> Speaking of pandemic</h2>
<div class="outline-text-2" id="text-6">
<p>
While cleaning out my car, I found the receipt from Target for a half
gallon of organic milk that I bought on 06 March 2020 at the beginning
of the Great San Jose Grocery Store Shortage COVID-19 Pandemic Panic
because my mom asked me to pick up some milk for dinner that
evening. This is memorable because:
</p>

<p>
(a) This was the fourth store I tried, after trying Save Mart,
Seafood City and Walgreens - all had <b>very</b> long lines and no milk.
</p>

<p>
(b) It was the second-to-last carton of milk in the store.
</p>

<p>
(c) It was organic, which I hardly ever buy.
</p>

<p>
(d) I used self-checkout - for the first time ever.
</p>

<p>
(e) Bought groceries with a credit card - I usually pay cash.
</p>

<p>
So many principles violated!
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-01-28 Sat 07:04</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
